//Задача: Напишите программу, которая на вход принимает трехзначное число и на выходе показывает вторую цыфру этого числа
//456->5
//782->8
//918->1

//------------------------Схема-------------------------
//1.Составить схему ввода данных
//2.Написать уровнение для находждения ВТОРОГО числа от вводимых данных
//3.Вывести второе число
//
//-----------------------Решение------------------------

Console.Clear();

Console.Write("Введите число для обработки: ");
int Digit = Convert.ToInt32(Console.ReadLine());
{
int SecDigit = 

}